#+TITLE: Does the leaf economic spectrum hold within plant functional types? A Bayesian multivariate trait meta-analysis
#+AUTHOR:
#+DATE:

#+OPTIONS: toc:nil tags:nil
#+CSL_STYLE: ecology.csl

#+LATEX_HEADER: \usepackage[left=1in,right=1in,top=1in,bottom=1in]{geometry}
#+LATEX_HEADER: \usepackage{lineno}

#+LATEX_HEADER: \usepackage[noblocks]{authblk}

#+LATEX_HEADER: \usepackage{setspace}

#+LATEX_HEADER: \usepackage{booktabs}

#+LATEX_HEADER: \hypersetup{colorlinks=false, pdfborder={0 0 0}}

#+LATEX_HEADER: \author[1,*]{Alexey N. Shiklomanov <alexey.shiklomanov@pnnl.gov>}
#+LATEX_HEADER: \affil[1]{Joint Global Change Research Institute, Pacific Northwest National Laboratory, College Park, MD}

#+LATEX_HEADER: \author[2]{Elizabeth M. Cowdery <ecowdery@bu.edu>}
#+LATEX_HEADER: \affil[2]{Department of Earth \& Environment, Boston University, Boston, MA}

#+LATEX_HEADER: \author[3]{Michael Bahn <Michael.Bahn@uibk.ac.at>}
#+LATEX_HEADER: \affil[3]{Institute of Ecology, University of Innsbruck, 6020 Innsbruck, Austria}

#+LATEX_HEADER: \author[4]{Chaeho Byun <chaeho.byun@mail.mcgill.ca>}
#+LATEX_HEADER: \affil[4]{School of Civil and Environmental Engineering, Yonsei University, Seoul 03722, Korea}

#+LATEX_HEADER: \author[5]{Steven Jansen <steven.jansen@uni-ulm.de>}
#+LATEX_HEADER: \affil[5]{Institute of Systematic Botany and Ecology, Ulm University, Albert-Einstein-Allee 11, 89081, Ulm, Germany}

#+LATEX_HEADER: \author[6]{Koen Kramer <koen.kramer@wur.nl>}
#+LATEX_HEADER: \affil[6]{Department of Vegetation, Forest, and Landscape Ecology, Wageningen Environmental Research and Wageningen University, Wageningen, Gelderland, The Netherlands}

#+LATEX_HEADER: \author[7,8]{Vanessa Minden <vanessa.minden@uni-oldenburg.de>}
#+LATEX_HEADER: \affil[7]{Institute for Biology and Environmental Sciences, Carl von Ossietzky-University of Oldenburg, Carl von Ossietzky Str. 9-11, 26129 Oldenburg, Germany}
* Tables                                                           :no_title:

#+BEGIN_EXPORT latex
\pagebreak
#+END_EXPORT

#+NAME: tab:pfts
#+BEGIN_SRC R :exports results :results output latex
library(shiklomanov2017np)
traits_file <- here::here("../np-trait-analysis/extdata/traits_analysis.rds")
try_data <- readRDS(traits_file)
n_present <- try_data %>%
  select(-ObservationID, -AccSpeciesID) %>%
  rename(pft = clm45) %>%
  group_by(pft) %>%
  summarize_all(~sum(!is.na(.x)))
n_species <- try_data %>%
  distinct(clm45, AccSpeciesID) %>%
  select(pft = clm45, species = AccSpeciesID) %>%
  count(pft, name = "Species")
n_both <- n_present %>%
  full_join(n_species, by = "pft") %>%
  mutate(
    pft = as.character(pft),
    label = pft2abbr[pft],
    pft = tools::toTitleCase(gsub("_", " ", pft)),
    pft = if_else(grepl("(Broad|Needle)", pft), paste(pft, "Tree"), pft)
  ) %>%
  select(`Label` = label, `PFT` = pft, `Species`,
         leaf_lifespan, SLA,
         ends_with("mass"), ends_with("area")) %>%
  rename(
    "Leaf lifespan" = leaf_lifespan
  )
species_caption <- paste(
  "\\label{tab:pfts}Names, labels, species counts,",
  "and number of non-missing observations of each trait",
  "for plant functional types (PFTs)",
  "used in this analysis."
)
col_names <- colnames(n_both)
col_names <- gsub("_?(mass|area)$", "", col_names)
kable(
  n_both,
  caption = species_caption,
  col.names = col_names,
  align = rep("c", ncol(n_species)),
  format = "latex",
  booktabs = TRUE
) %>%
  kableExtra::add_header_above(c(" " = 5, "Mass" = 5, "Area" = 5)) %>%
  kableExtra::kable_styling(latex_options = c("hold_position", "scale_down"))
#+END_SRC

#+RESULTS: tab:pfts
#+begin_export latex
\begin{table}[!h]

\caption{\label{tab:}\label{tab:pfts}Names, labels, species counts, and number of non-missing observations of each trait for plant functional types (PFTs) used in this analysis.}
\centering
\resizebox{\linewidth}{!}{
\begin{tabular}{ccccccccccccccc}
\toprule
\multicolumn{5}{c}{ } & \multicolumn{5}{c}{Mass} & \multicolumn{5}{c}{Area} \\
\cmidrule(l{3pt}r{3pt}){6-10} \cmidrule(l{3pt}r{3pt}){11-15}
Label & PFT & Species & Leaf lifespan & SLA & N & P & Rd & Vcmax & Jmax & N & P & Rd & Vcmax & Jmax\\
\midrule
BlETr & Broadleaf Evergreen Tropical Tree & 1229 & 153 & 11710 & 7547 & 2912 & 237 & 205 & 58 & 4023 & 1684 & 326 & 225 & 152\\
BlETe & Broadleaf Evergreen Temperate Tree & 363 & 135 & 2210 & 1811 & 1194 & 121 & 36 & 16 & 928 & 339 & 196 & 106 & 87\\
BlDTr & Broadleaf Deciduous Tropical Tree & 286 & 82 & 2166 & 1545 & 812 & 98 & 54 & 30 & 813 & 500 & 113 & 56 & 53\\
BlDTe & Broadleaf Deciduous Temperate Tree & 345 & 181 & 9536 & 5982 & 2163 & 942 & 245 & 576 & 2163 & 398 & 866 & 697 & 849\\
BlDBo & Broadleaf Deciduous Boreal Tree & 62 & 58 & 908 & 898 & 340 & 142 & 0 & 0 & 141 & 60 & 11 & 5 & 5\\
\addlinespace
NlETe & Needleleaf Evergreen Temperate Tree & 130 & 66 & 2958 & 4940 & 3729 & 262 & 92 & 91 & 1227 & 462 & 84 & 274 & 106\\
NlEBo & Needleleaf Evergreen Boreal Tree & 30 & 24 & 530 & 1457 & 393 & 493 & 0 & 0 & 101 & 14 & 16 & 3 & 3\\
NlD & Needleleaf Deciduous Tree & 19 & 16 & 195 & 328 & 179 & 34 & 1 & 0 & 48 & 10 & 3 & 4 & 0\\
ShE & Shrub Evergreen & 1120 & 298 & 5018 & 3555 & 2404 & 207 & 22 & 13 & 1376 & 747 & 205 & 41 & 32\\
ShDTe & Shrub Deciduous Temperate & 330 & 100 & 3026 & 1525 & 1227 & 10 & 9 & 1 & 576 & 281 & 13 & 33 & 19\\
\addlinespace
ShDBo & Shrub Deciduous Boreal & 94 & 80 & 482 & 552 & 313 & 0 & 1 & 1 & 133 & 51 & 0 & 1 & 1\\
C3GAr & C3 Grass Arctic & 157 & 65 & 989 & 996 & 573 & 11 & 1 & 2 & 219 & 85 & 7 & 1 & 2\\
C3GTe & C3 Grass Temperate & 624 & 76 & 6322 & 3802 & 1541 & 103 & 21 & 27 & 1257 & 382 & 93 & 52 & 47\\
C4G & C4 Grass & 255 & 31 & 1312 & 1461 & 335 & 44 & 0 & 0 & 410 & 56 & 28 & 0 & 0\\
\bottomrule
\end{tabular}}
\end{table}
#+end_export

